function [z0, fv, fphi, t, xb, yb] = testcase(id)

switch id
    case {0,'Circle','circle'}
        t = 0:0.001:30;      % 求解微分方程的时间范围
        l = 2.959;
        R = l/tand(20);
        z0 = [0,-R, 0];
        
        % 边界
        xb = 1.5*[-1, 1, 1, -1, -1]*R; 
        yb = 1.5*[-1, -1, 1, 1, -1]*R;
        
        % 固定的转向和速度
        fphi = @(t) 20*(t>=0);   fv = @(t) 5*(t>=0);
    case {1,'Parking','parking'}
        t = 0:0.001:75;      % 求解微分方程的时间范围
        z0 = [-2.959/2,0,0]; % 车身初始条件 = [车身朝向, 车身中心坐标x和y]
        
        % 边界
        xb = [-5, 8, 8,14,14,20,20.0,25.0,25,20,20, 3,3,-5];
        yb = [-3,-3,10,10,-3,-3, 6.5, 6.5,10,10,16,16,3, 3];
        
        % 前轮最大转动角速度取 20 deg/s
        dphi = 20;          % [deg/s] 前轮转动角速度
        tmax = 470/16/dphi; % 前轮最大偏转角为 470/16 度，则转动时间为 470/16/dbeta
        % 前轮偏转角度随时间的变化（= 盘转动角度/16）：
        fphi = @(t) 0 + dphi*min(t- 1.00,tmax*1).*(t> 1.00) - ...
                        dphi*min(t- 9.37,tmax*1).*(t> 9.37) - ...
                        dphi*min(t-12.20,tmax*1).*(t>12.20) + ...
                        dphi*min(t-28.87,tmax*1).*(t>28.87) + ...
                        dphi*min(t-36.00,tmax*1).*(t>36.00) - ...
                        dphi*min(t-65.39,tmax*1).*(t>65.39);
        
        % 后轴中点速度（由油门和刹车控制）
        fv = @(t) 1.0 - 0.2*min(t-32.5,6.5).*(t>32.5) + ...
                        0.2*min(t-73.1,1.5).*(t>73.1);
        
    case {2,'Tesla','tesla'}
        t = 0:0.001:6.5;      % 求解微分方程的时间范围 
        z0 = [0, -3, 5.4268]; % 车身初始条件 = [车身朝向, 车身中心坐标x和y]
        
        % 边界
        xb = [-5 180 180 -5];
        yb = [-5.4975 12.0775 22.1225 4.5475];

        % 后轴中心速度函数
        t0 = 21.35;
        ti = [ 21.35,  22.36,  23.38,  24.40, 25.41, 26.43, 27.45]-t0;
        vi  = [119.00, 118.50, 116.00, 109.50, 94.00, 74.00, 48.50]/3.6;
        fv = @(t) interp1(ti,vi,t,'spline');
        
        % 前轮转角函数：方向盘前轮转向传动比10:1
        tj = [ 23.35, 24.36, 25.37, 26.38, 27.19, 27.39, 27.7]-t0;
        pj = [ -0.10,  0.30,  1.10, -0.20, -2.0, -89.60,-270]/10;  
        fphi = @(t) interp1(tj,pj,t,'pchip');
        
        % % 可视化插值结果
        % figure; plot(ti, vi, 'o', t,   fv(t)); 
        % xlabel('时间(s)'); ylabel('速度(m/s)')
        % figure; plot(tj, pj, 'o', t, fphi(t)); 
        % xlabel('时间(s)'); ylabel('转角(deg)')
end